app/Controllers/Pariwisata.php

    public function index()
    {
        $pariwisata=$this->pariwisataModel->where('status','publish')->findAll();
---
SELECT *
FROM `pariwisata`
WHERE `status` = 'publish'