app/Controllers/Sejarah.php

     public function detail($id){
        $sejarah=$this->sejarahModel->where('id',$id)->first();
---
SELECT *
FROM `sejarah`
WHERE `id` = '4'
 LIMIT 1